In [40]:
# -*-coding:UTF-8-*- 
from platform import python_version
import os, time, socket, glob

print("【日期時間】{}".format(time.strftime("%Y/%m/%d %H:%M:%S")))
print("【工作目錄】{}".format(os.getcwd()))
# print("【主機名稱】{} ({})".format(socket.gethostname(),socket.gethostbyname(socket.gethostname())))
print("【Python】{}".format(python_version()))

%autosave 120

【日期時間】2024/04/23 09:15:00
【工作目錄】/Users/abby/AbbyPy
【Python】3.8.5

Autosaving every 120 seconds

In [1]:
import pandas as pd

In [7]:
s = pd.Series([1, 3, 5, 7, 9])

print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [9]:
print(s.values)
print(s.index)
print(s.dtype)f
print(s.shape)

[1 3 5 7 9]
RangeIndex(start=0, stop=5, step=1)
int64
(5,)

In [77]:
data = {'name':['Alice', 'Bob', 'Charlie', 'David'],
        'age':[25, 32, 18, 47],
        'city':['New York', 'Paris', 'London', 'Berlin']}

df = pd.DataFrame(data)

df

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin

In [19]:
print(df.values)
print(df.index)
print(df.dtypes)
print(df.shape)

[['Alice' 25 'New York']
 ['Bob' 32 'Paris']
 ['Charlie' 18 'London']
 ['David' 47 'Berlin']]
RangeIndex(start=0, stop=4, step=1)
name    object
age      int64
city    object
dtype: object
(4, 3)

#### <font color='blue'>DataFrame資料選取：一維度列的選取

In [20]:
df['name']

0      Alice
1        Bob
2    Charlie
3      David
Name: name, dtype: object

In [21]:
df[['name', 'city']]

      name      city
0    Alice  New York
1      Bob     Paris
2  Charlie    London
3    David    Berlin

In [22]:
df[0:3]

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London

In [23]:
# 也可以利用索引名稱進行選取 DataFrame.set_index()
# inplace=True -> 原始的數據會被修改 -> 拿來當index的欄位就不再存在
# inplace=False (default) -> 原始的數據不會被修改 
df.set_index('name', inplace=True)
df['Alice':'David']

         age      city
name
Alice     25  New York
Bob       32     Paris
Charlie   18    London
David     47    Berlin

In [25]:
# 因為更改了原始數據，因此資料集變為兩欄
df.shape

(4, 2)

#### <font color='blue'>DataFrame資料選取：二維選取 .loc 基於名稱的選取
* df.loc[row_indexer, column_indexer]

In [26]:
# 選取 "Alice" 和 "Charlie" 兩行的 "age" 和 "city" 這兩列

df.loc[['Alice', 'Charlie'],['age', 'city']]

         age      city
name
Alice     25  New York
Charlie   18    London

#### <font color='blue'>DataFrame資料選取：條件篩選，利用遮罩選取

In [27]:
mask = df['age'] > 30
df[mask]

       age    city
name
Bob     32   Paris
David   47  Berlin

In [29]:
# 有多個條件時，用()括出每個條件
mask = (df['age'] > 30) & (df['city'] == 'Paris')
df[mask]

      age   city
name
Bob    32  Paris

In [79]:
df.loc[df['age']>25,['name','city']]

    name    city
1    Bob   Paris
3  David  Berlin

#### <font color='blue'>DataFrame的算術運算與排序

In [178]:
data1 = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
         'age': [25, 32, 18, 47],
         'city': ['New York', 'Paris', 'London', 'Berlin']}
df1 = pd.DataFrame(data1)

data2 = {'name': ['Eva', 'Frank', 'Grace', 'Henry'],
         'age': [29, 23, 37, 31],
         'city': ['Rome', 'Sydney', 'Tokyo', 'Moscow']}
df2 = pd.DataFrame(data2)

In [32]:
# 純加法 (在DataFrame內不合理)
df1 + df2

           name  age          city
0      AliceEva   54  New YorkRome
1      BobFrank   55   ParisSydney
2  CharlieGrace   55   LondonTokyo
3    DavidHenry   78  BerlinMoscow

In [33]:
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 32, 18, 47],
        'city': ['New York', 'Paris', 'London', 'Berlin']}

df = pd.DataFrame(data)

In [35]:
# 按照欄位進行排序 DataFrame.sort_values(by='欄位')
df.sort_values(by='age', ascending=False)

      name  age      city
3    David   47    Berlin
1      Bob   32     Paris
0    Alice   25  New York
2  Charlie   18    London

In [36]:
# 按照索引進行排序
df.sort_index()

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin

In [37]:
# 將索引改為name的值並排序
df.set_index('name', inplace=True)
df.sort_index()

         age      city
name
Alice     25  New York
Bob       32     Paris
Charlie   18    London
David     47    Berlin

#### <font color='blue'>DataFrame的合併

##### <font color='blue'> - pd.concat():可以選擇用行軸還是列軸合併

In [38]:
# concat()
# 沿著列軸合併，axis=0 (欄位相同)
pd.concat([df1, df2], axis=0)

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin
0      Eva   29      Rome
1    Frank   23    Sydney
2    Grace   37     Tokyo
3    Henry   31    Moscow

In [179]:
# 避免索引重複，使用ignore_index=True
pd.concat([df1, df2], axis=0, ignore_index=True)

      name  age      city
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47    Berlin
4      Eva   29      Rome
5    Frank   23    Sydney
6    Grace   37     Tokyo
7    Henry   31    Moscow

In [39]:
# concat()
# 沿著行軸合併，axis=1 
pd.concat([df1, df2], axis=1)

      name  age      city   name  age    city
0    Alice   25  New York    Eva   29    Rome
1      Bob   32     Paris  Frank   23  Sydney
2  Charlie   18    London  Grace   37   Tokyo
3    David   47    Berlin  Henry   31  Moscow

##### <font color='blue'> - pd.merge():可以根據 <u>指定的欄位</u> 將兩個DataFrame物件合併在一起

In [46]:
data1 = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
         'age': [25, 32, 18, 47],
         'city': ['New York', 'Paris', 'London', 'Berlin']}
df1 = pd.DataFrame(data1)

data2 = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
         'salary': [5000, 6000, 7000, 8000]}
df2 = pd.DataFrame(data2)

In [44]:
pd.merge(df1, df2, on='name')

      name  age      city  salary
0    Alice   25  New York    5000
1      Bob   32     Paris    6000
2  Charlie   18    London    7000
3    David   47    Berlin    8000

##### <font color='blue'>- join():可以將兩個DataFrame物件 <u>按照索引</u> 合併在一起

In [181]:
# 注意：這裡不能有重複的欄位名稱出現
data1 = {'age': [25, 32, 18, 47],
         'city': ['New York', 'Paris', 'London', 'Berlin']}
df1 = pd.DataFrame(data1, index=['Alice', 'Bob', 'Charlie', 'David'])

data2 = {'salary': [5000, 6000, 7000, 8000]}
df2 = pd.DataFrame(data2, index=['Alice', 'Bob', 'Charlie', 'David'])

In [49]:
df1.join(df2)

         age      city  salary
Alice     25  New York    5000
Bob       32     Paris    6000
Charlie   18    London    7000
David     47    Berlin    8000

#### <font color='blue'>DataFrame的分組Groupby

In [50]:
data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank'],
        'age': [25, 32, 18, 47, 23, 31],
        'gender': ['female', 'male', 'female', 'male', 'female', 'male'],
        'city': ['New York', 'Paris', 'London', 'Berlin', 'New York', 'Paris'],
        'salary': [50000, 80000, 25000, 100000, 35000, 75000]}
df = pd.DataFrame(data)

In [52]:
# 根據city分組看多少人、平均薪資與平均年齡

df.groupby('city').agg({'name':'count','age':'mean','salary':'mean'})

          name   age  salary
city
Berlin       1  47.0  100000
London       1  18.0   25000
New York     2  24.0   42500
Paris        2  31.5   77500

In [55]:
df.groupby(['city','gender']).agg({'name':'count','age':'mean','salary':'mean'})

                 name   age  salary
city     gender
Berlin   male       1  47.0  100000
London   female     1  18.0   25000
New York female     2  24.0   42500
Paris    male       2  31.5   77500

#### <font color='brown'>作業01【實作題】 資料選取

In [177]:
import pandas as pd
import numpy as np

# 生成60個10-40(不含)的隨機整數，並且排成四列 (-1表示列數自動計算)
np.random.seed(3)
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1,4))

# - 1. filtered by first column > 20?
df[df[0]>20]

# - 2. filtered by first column + second column > 50
df[df[0]+df[1]>50]

# - 3. filtered by first column < 30 or second column > 30
df[(df[0]<30) | (df[1]>30)]

# - 4. filtered by total sum of row > 100
df[df.sum(axis=1)>100]


# 延伸第4題：一維的Series轉為DataFrame並賦予欄位名稱 (Series物件不包含欄位名稱)
row_sums = df.sum(axis=1)
print(type(result)) # 是一維的Series物件

df_ = pd.DataFrame({'Row Sum':row_sums}) # 轉成DataFrame設定欄位名稱
result_ = pd.concat([df, df_], axis=1)
result_[result_['Row Sum']>100]

# 延伸第4題：更簡單的加入欄位跟資料
df_temp = df.copy()
row_sums = df.sum(axis=1)
df_temp['Row Sum'] = row_sums
df_temp[df_temp['Row Sum']>100]


# 下方code錯誤，因為不存在索引為5的欄位
# result_[result_[5]>100]

<class 'pandas.core.series.Series'>

     0   1   2   3  Row Sum
0   20  34  35  13      102
2   39  29  20  21      109
3   35  19  20  31      105
5   22  39  17  24      102
6   34  36  27  36      133
10  20  34  37  17      108
11  34  21  11  37      103
13  27  31  24  30      112
14  38  33  32  10      113

#### <font color='brown'>作業02【實作題】 資料匯總

In [101]:
d = [
    {'city': 'Austin', 'visitor': 139, 'weekday': 'Sun'},
    {'city': 'Dallas', 'visitor': 237, 'weekday': 'Sun'},
    {'city': 'Austin', 'visitor': 326, 'weekday': 'Mon'},
    {'city': 'Dallas', 'visitor': 456, 'weekday': 'Mon'}
]

df = pd.DataFrame(d)
df.groupby('weekday').agg({'visitor':'sum'})

         visitor
weekday
Mon          782
Sun          376

#### <font color='brown'>作業03【實作題】 檔案串接與資料存取

In [138]:
fname = 'https://raw.githubusercontent.com/kiang/pharmacies/master/data.csv'
df = pd.read_csv(fname, sep=',', encoding='utf-8', engine='python')
print(df.shape)
print(df.isna().sum())
df.head(3)

(7025, 18)
醫事機構代碼         0
醫事機構名稱         0
醫事機構種類       165
電話             0
地址             0
分區業務組        165
特約類別         165
服務項目         165
診療科別         165
終止合約或歇業日期    165
固定看診時段       165
備註             0
TGOS X         6
TGOS Y         6
縣市            86
鄉鎮市區          86
村里            86
看診星期         154
dtype: int64

,醫事機構代碼,醫事機構名稱,醫事機構種類,電話,地址,分區業務組,特約類別,服務項目,診療科別,終止合約或歇業日期,固定看診時段,備註,TGOS X,TGOS Y,縣市,鄉鎮市區,村里,看診星期
0,5901010058,安郁藥局,藥師自營,(02)25774551,臺北市松山區八德路３段１２巷５１弄１６號１樓,臺北業務組,藥局,-,-,20230529.0,星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看...,** 我們已經沒賣口罩 **沒賣口罩,121.551182,25.046086,臺北市,松山區,敦化里,NNNNNNYNNNNNNYNNNNNNY
1,5901010076,榮星藥局,藥劑生自營,(02)27124696,臺北市松山區南京東路４段１３３巷５弄１號,臺北業務組,藥局,-,-,20231129.0,星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看...,-,121.555235,25.052137,臺北市,松山區,東勢里,NNNNNNNNNNNNNNNNNNNNY
2,5901010085,安世藥局,藥師自營,(02)27133405,臺北市松山區南京東路４段１３３巷５弄９號,臺北業務組,藥局,-,-,20230724.0,星期一上午看診、星期二上午看診、星期三上午看診、星期四上午看診、星期五上午看診、星期六上午看...,09:00~22:00,121.555562,25.052140,臺北市,松山區,東勢里,NNNNNNNNNNNNNNNNNNNNY

In [148]:
result = df.groupby('縣市').agg({'縣市':'count'})
# 因為索引名稱與欄位名稱都是'縣市'，需要更改索引名稱才可以排序，
# 否則會Error:'縣市' is both an index level and a column label, which is ambiguous.
result = df.groupby('縣市').agg({'縣市':'count'}).rename_axis('地址')
result.sort_values('縣市',ascending=False)[:5]

(22, 1)

       縣市
地址
新北市  1256
臺中市   855
臺北市   780
高雄市   718
桃園市   670

In [144]:
result = df.groupby('縣市').agg({'醫事機構代碼':'count'})
result = result.sort_values('醫事機構代碼',ascending=False)
result[:5]

     醫事機構代碼
縣市
新北市    1256
臺中市     855
臺北市     780
高雄市     718
桃園市     670